Documents/ЗакупНеноменклатурный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ЗакупНеноменклатурный</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НеноменклатурныйМатериал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГдеКупить</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакупНеноменклатурный/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	// { Васильев Александр Леонидович [10.01.2014]
	// доработать бы запрос, что б попадали из текущего документа
	// если перезаполняешь
	// } Васильев Александр Леонидович [10.01.2014]
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Производство", Объект.Подразделение);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпецификацияНеноменклатурныйМатериал.Ссылка КАК Спецификация,
	|	ВЫРАЗИТЬ(СпецификацияНеноменклатурныйМатериал.ГдеКупить КАК СТРОКА(100)) КАК ГдеКупить,
	|	СпецификацияНеноменклатурныйМатериал.ЕдиницаИзмерения,
	|	СпецификацияНеноменклатурныйМатериал.Количество,
	|	СпецификацияНеноменклатурныйМатериал.Наименование,
	|	СпецификацияНеноменклатурныйМатериал.Номенклатура
	|ИЗ
	|	Документ.Спецификация.НеноменклатурныйМатериал КАК СпецификацияНеноменклатурныйМатериал
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакупНеноменклатурный.НеноменклатурныйМатериал КАК ЗакупНеноменклатурныйНеноменклатурныйМатериал
	|		ПО СпецификацияНеноменклатурныйМатериал.Ссылка = ЗакупНеноменклатурныйНеноменклатурныйМатериал.Спецификация
	|			И СпецификацияНеноменклатурныйМатериал.Наименование = ЗакупНеноменклатурныйНеноменклатурныйМатериал.Наименование
	|			И СпецификацияНеноменклатурныйМатериал.Номенклатура = ЗакупНеноменклатурныйНеноменклатурныйМатериал.Номенклатура
	|			И СпецификацияНеноменклатурныйМатериал.Количество = ЗакупНеноменклатурныйНеноменклатурныйМатериал.Количество
	|ГДЕ
	|	СпецификацияНеноменклатурныйМатериал.Ссылка.Проведен
	|	И СпецификацияНеноменклатурныйМатериал.Ссылка.Производство = &Производство
	|	И ЗакупНеноменклатурныйНеноменклатурныйМатериал.Ссылка ЕСТЬ NULL";
	
	Объект.НеноменклатурныйМатериал.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
